backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - latent_input
    - 0
    - 0
  - - label_input_dec
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - 10
      - 50
      dtype: float32
      name: latent_input
      ragged: false
      sparse: false
    inbound_nodes: []
    name: latent_input
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - 10
      - 10
      dtype: float32
      name: label_input_dec
      ragged: false
      sparse: false
    inbound_nodes: []
    name: label_input_dec
  - class_name: RepeatVector
    config:
      dtype: float32
      n: 200
      name: repeat_vector
      trainable: true
    inbound_nodes:
    - - - latent_input
        - 0
        - 0
        - {}
    name: repeat_vector
  - class_name: RepeatVector
    config:
      dtype: float32
      n: 200
      name: repeat_vector_1
      trainable: true
    inbound_nodes:
    - - - label_input_dec
        - 0
        - 0
        - {}
    name: repeat_vector_1
  - class_name: Concatenate
    config:
      axis: 2
      dtype: float32
      name: concatenate
      trainable: true
    inbound_nodes:
    - - - repeat_vector
        - 0
        - 0
        - &id001 {}
      - - repeat_vector_1
        - 0
        - 0
        - *id001
    name: concatenate
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: lstm
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 100
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - concatenate
        - 0
        - 0
        - {}
    name: lstm
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 100
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: SimpleRNN
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: decoder_output
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      units: 99
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: decoder_output
  name: Decoder
  output_layers:
  - - decoder_output
    - 0
    - 0
keras_version: 2.4.0
