backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - discmt_input
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 50
      dtype: float32
      name: discmt_input
      ragged: false
      sparse: false
    inbound_nodes: []
    name: discmt_input
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - discmt_input
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.0
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dropout
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 40
      use_bias: true
    inbound_nodes:
    - - - dropout
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: discmt_output
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: discmt_output
  name: Discmt
  output_layers:
  - - discmt_output
    - 0
    - 0
keras_version: 2.4.0
